---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsRunType.HasTreads
source: html/afc95198-c67e-7de7-3237-67f03e106c2f.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunType.HasTreads Property

True if the stairs run will include treads on steps, false otherwise.

## Syntax (C#)
```csharp
public bool HasTreads { get; set; }
```